# pandas

In [3]:
import pandas as pd

In [5]:
import numpy as np
df = pd.DataFrame(np.arange(0,20))

In [6]:
df

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11
12  12
13  13
14  14
15  15
16  16
17  17
18  18
19  19

In [16]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['a','b','c','d','e'],columns=['c1','c2','c3','c4'])

In [17]:
df

   c1  c2  c3  c4
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e  16  17  18  19

In [19]:
df.loc['a']

c1    0
c2    1
c3    2
c4    3
Name: a, dtype: int32

In [21]:
df[['c1','c2']]

   c1  c2
a   0   1
b   4   5
c   8   9
d  12  13
e  16  17

In [22]:
df.iloc[0:2,0:2]

   c1  c2
a   0   1
b   4   5

In [23]:
df.isnull()

      c1     c2     c3     c4
a  False  False  False  False
b  False  False  False  False
c  False  False  False  False
d  False  False  False  False
e  False  False  False  False

In [24]:
df.isnull().sum()

c1    0
c2    0
c3    0
c4    0
dtype: int64

In [25]:
df.value_counts()

c1  c2  c3  c4
0   1   2   3     1
4   5   6   7     1
8   9   10  11    1
12  13  14  15    1
16  17  18  19    1
dtype: int64

In [29]:
df['c1'].unique()

array([ 0,  4,  8, 12, 16])

In [4]:
import pandas as pd
import numpy as np

In [13]:
df=pd.read_csv("C:/Users/hp/Downloads/annual-enterprise-survey-2023-financial-year-provisional.csv")

In [14]:
df.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2023,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,930995,ANZSIC06 divisions A-S (excluding classes K633...
1,2023,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,821630,ANZSIC06 divisions A-S (excluding classes K633...
2,2023,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,84354,ANZSIC06 divisions A-S (excluding classes K633...
3,2023,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,25010,ANZSIC06 divisions A-S (excluding classes K633...
4,2023,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,832964,ANZSIC06 divisions A-S (excluding classes K633...

In [15]:
df['Industry_code_NZSIOC']

0        99999
1        99999
2        99999
3        99999
4        99999
         ...
50980     ZZ11
50981     ZZ11
50982     ZZ11
50983     ZZ11
50984     ZZ11
Name: Industry_code_NZSIOC, Length: 50985, dtype: object

In [16]:
df

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2023,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,930995,ANZSIC06 divisions A-S (excluding classes K633...
1,2023,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,821630,ANZSIC06 divisions A-S (excluding classes K633...
2,2023,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,84354,ANZSIC06 divisions A-S (excluding classes K633...
3,2023,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,25010,ANZSIC06 divisions A-S (excluding classes K633...
4,2023,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,832964,ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
50980,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50981,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50982,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50983,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50984,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50985 entries, 0 to 50984
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Year                         50985 non-null  int64
 1   Industry_aggregation_NZSIOC  50985 non-null  object
 2   Industry_code_NZSIOC         50985 non-null  object
 3   Industry_name_NZSIOC         50985 non-null  object
 4   Units                        50985 non-null  object
 5   Variable_code                50985 non-null  object
 6   Variable_name                50985 non-null  object
 7   Variable_category            50985 non-null  object
 8   Value                        50985 non-null  object
 9   Industry_code_ANZSIC06       50985 non-null  object
dtypes: int64(1), object(9)
memory usage: 3.9+ MB

In [18]:
df.describe()

               Year
count  50985.000000
mean    2018.000000
std        3.162309
min     2013.000000
25%     2015.000000
50%     2018.000000
75%     2021.000000
max     2023.000000

In [26]:
data = ("col1,col2,col3\n"
        "1,2,3\n"
        "5,6,6")

In [27]:
data

'col1,col2,col3\n1,2,3\n5,6,6'

In [28]:
from io import StringIO

In [34]:
s = pd.read_csv(StringIO(data))

In [35]:
s.head()

   col1  col2  col3
0     1     2     3
1     5     6     6

In [39]:
s = pd.read_csv(StringIO(data),index_col=2)
s

      col1  col2
col3
3        1     2
6        5     6

# json to csv

In [49]:
data = '{"name":"annu","email":"annu@gmail.com","position":{"title1":"a","title2":"b"}}'

In [50]:
data

'{"name":"annu","email":"annu@gmail.com","position":{"title1":"a","title2":"b"}}'

In [51]:
 df=pd.read_json(data)

In [52]:
df

        name           email position
title1  annu  annu@gmail.com        a
title2  annu  annu@gmail.com        b

In [53]:
s = df.to_csv()

In [54]:
s

',name,email,position\r\ntitle1,annu,annu@gmail.com,a\r\ntitle2,annu,annu@gmail.com,b\r\n'

In [56]:
df.to_json()

'{"name":{"title1":"annu","title2":"annu"},"email":{"title1":"annu@gmail.com","title2":"annu@gmail.com"},"position":{"title1":"a","title2":"b"}}'

In [57]:
df.to_json(orient="records")

'[{"name":"annu","email":"annu@gmail.com","position":"a"},{"name":"annu","email":"annu@gmail.com","position":"b"}]'

In [62]:
url="https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"
df = pd.read_html(url)

In [64]:
df

[                             Bank NameBank       CityCity StateSt  CertCert  \
 0    Republic First Bank dba Republic Bank   Philadelphia      PA     27332
 1                            Citizens Bank       Sac City      IA      8758
 2                 Heartland Tri-State Bank        Elkhart      KS     25851
 3                      First Republic Bank  San Francisco      CA     59017
 4                           Signature Bank       New York      NY     57053
 ..                                     ...            ...     ...       ...
 564                     Superior Bank, FSB       Hinsdale      IL     32646
 565                    Malta National Bank          Malta      OH      6629
 566        First Alliance Bank & Trust Co.     Manchester      NH     34264
 567      National State Bank of Metropolis     Metropolis      IL      3815
 568                       Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0      Fulton Bank, National Association      April 26, 2024     10546
 1              Iowa Trust & Savings Bank    November 3, 2023     10545
 2                 Dream First Bank, N.A.       July 28, 2023     10544
 3              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 4                    Flagstar Bank, N.A.      March 12, 2023     10540
 ..                                   ...                 ...       ...
 564                Superior Federal, FSB       July 27, 2001      6004
 565                    North Valley Bank         May 3, 2001      4648
 566  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 567              Banterra Bank of Marion   December 14, 2000      4646
 568                   Bank of the Orient    October 13, 2000      4645

 [569 rows x 7 columns]]